2.3 Сделать свои реализации функций
int printf (IN const char *format, OUT char **p, ...)
int scanf (IN const char *format, OUT char **p, ...)

Условия для оценки 3.

Они должны работать аналогично стандартным функциям.
Функции возвращают в случае успеха число обработанных байт: printf - количество выведенных байт, scanf - количество считанных байт. В случае ошибки возвращают отрицательное число.
Второй параметр p является указателем на указатель на символ. Если он ненулевой, по этому указателю функция возвращает указатель на ошибочный символ.
Если форматная строка, содержит ошибочный символ (например, несуществующий спецификатор), то функции возвращают -1 и по указателю p возвращают указатель на первый неправильный символ.
Функция scanf в соответствии со спецификаторами осуществляет перевод строк в числа. Если при таком переводе происходит ошибка (например, переполнение числа или ошибочные символы в строке), функция возвращает -(n+1), где n - порядковый номер спецификатора.

При реализации сканирования форматной строки и алгоритмов преобразований не должны использоваться никакие библиотечные функции.
Для работы с консолью нужно использовать функции чтения/записи байтов из консоли (например, _read, _write, read, write, ReadFile, WriteFile, ReadConsole, WriteConsole).
Для работы с произвольным множеством аргументов использовать va_list, va_start, va_arg и va_end.

Для функций printf, scanf реализовать поддержку следующих стандартных спецификаторов:
%d, %u, %x, %X, %s, %c
Для спецификаторов поддерживать стандартный синтаксис выравнивания и байт забивки. Например, "%02X", "%10c", "%0*d", "%8d", "%08d", "%-10s".

Написать программу, демонстрирующую работу этих функций.


Условия для оценки 4.

Дополнительно к предыдущим требованиям.
Придумать собственные спецификаторы (и их формат), которые будут позволять ввод/вывод знаковых и беззнаковых чисел в произвольной n-ичной системе счислений, где n от 2 до 62 (символы из алфавита {0...9, a...z, A...Z}).
Кроме того придумать способ (внутри спецификатора или в аргументе) задания собственного алфавита. Например десятичное число 10 в 2-ичной системе счисления с алфавитом {A, Z} будет "ZAZA".